
[
    {
        "id": 1,
        "date": "17 Juin 2024",
        "title": "Gestscol",
        "author": "Eric WAGNER",
        "tags": [
            "Front-End",
            "Back-end",
            "Laravel",
            "TailwindCSS",
            "MySQL",
            "PHP"
        ],
        "description": "Gestscol est un site web réalisé dans le cadre d'un projet scolaire, afin de mettre en avant nos compétences en développement web.",
        "content":"<h4>Gestscol, c'est quoi ?</h4><h5>Fonctionnalités de Gestscol</h5><ul><li><span><strong>Gestion des inscriptions et des admissions :</strong></span><ul><li>Permet de gérer les inscriptions des nouveaux élèves et les réinscriptions des élèves actuels.</li><li>Automatise le processus d’admission, de la soumission de la candidature à l’acceptation finale.</li></ul></li><li><span><strong>Gestion des élèves :</strong></span><ul><li>Suivi des informations personnelles et académiques des élèves.</li><li>Gestion des dossiers scolaires, y compris les notes, les absences, les retards, et les sanctions disciplinaires.</li><li>Outils pour la communication avec les parents, incluant les bulletins de notes et les notifications.</li></ul></li><li><span><strong>Gestion des enseignants et du personnel :</strong></span><ul><li>Suivi des informations personnelles et professionnelles du personnel enseignant et administratif.</li><li>Gestion des emplois du temps, des congés et des absences.</li><li>Outils de planification et de répartition des tâches.</li></ul></li><li><span><strong>Gestion des emplois du temps :</strong></span><ul><li>Création et gestion des emplois du temps pour les élèves et les enseignants.</li><li>Prise en compte des contraintes spécifiques, comme les disponibilités des enseignants et la répartition des salles de classe.</li></ul></li><li><span><strong>Gestion financière :</strong></span><ul><li>Suivi des paiements des frais de scolarité et des autres frais.</li><li>Gestion des bourses, des subventions et des autres aides financières.</li><li>Génération de rapports financiers pour la comptabilité.</li></ul></li><li><span><strong>Gestion documentaire :</strong></span><ul><li>Centralisation des documents administratifs et pédagogiques.</li><li>Accès sécurisé aux documents pour les enseignants, les élèves et les parents.</li><li>Archivage des documents pour une consultation ultérieure.</li></ul></li><li><span><strong>Communication et collaboration :</strong></span><ul><li>Plateformes de communication entre les enseignants, les élèves et les parents.</li><li>Outils de collaboration pour les projets et les activités parascolaires.</li><li>Notifications et alertes pour les événements scolaires et les rappels importants.</li></ul></li></ul><h5>Objectifs de Gestscol</h5><ul><li><span><strong>Automatisation des processus administratifs :</strong></span> Réduire le temps consacré aux tâches administratives répétitives, permettant ainsi au personnel scolaire de se concentrer davantage sur l'enseignement et le soutien aux élèves.</li><li><span><strong>Centralisation des informations :</strong></span> Fournir une plateforme unique où toutes les informations relatives à l’école, aux élèves, aux enseignants et au personnel peuvent être stockées et gérées de manière efficace.</li><li><span><strong>Amélioration de la communication :</strong></span> Faciliter la communication entre les différents acteurs de la communauté scolaire, incluant les enseignants, les élèves, les parents et l’administration.</li><li><span><strong>Suivi académique :</strong></span> Permettre un suivi rigoureux et en temps réel des performances académiques des élèves, aidant ainsi à identifier les besoins spécifiques et à mettre en place des mesures de soutien appropriées.</li><li><span><strong>Sécurité et confidentialité :</strong></span> Assurer la protection des données personnelles et confidentielles de tous les utilisateurs du système grâce à des protocoles de sécurité avancés.</li><li><span><strong>Efficacité opérationnelle :</strong></span> Optimiser les ressources de l’école, qu’il s’agisse de la gestion des salles de classe, des emplois du temps, ou des finances, pour améliorer l’efficacité globale de l’établissement.</li></ul><p>En résumé, Gestscol est une solution intégrée qui vise à améliorer la gestion des établissements scolaires en centralisant et en automatisant de nombreuses tâches administratives et pédagogiques, tout en favorisant la communication et la collaboration entre les différents acteurs de la communauté éducative.</p><h4>Réalisations</h4><p>Pour réaliser ce site j'ai utilisé le framework PHP Laravel. Je devais mettre en place un emploi du temps qui correspondait à celui de la personne connectée. Je devais faire en sorte de créer les utilisateurs en fonction d'un fichier excel qui serait importé sur le site. J'ai pû réaliser ces fonctionnalités grâce à l'utilisation de Laravel et de la librairie Maatwebsite/Laravel-Excel. J'ai également utilisé TailwindCSS pour le design du site. J'ai utilisé MySQL pour la base de données. J'ai également utilisé PHP pour la partie back-end du site.</p><h4>Conclusion</h4><p>Grâce à ce projet, j'ai pu mettre en pratique mes compétences en développement web, en utilisant des technologies modernes et en répondant à des besoins concrets. J'ai appris à travailler en équipe, à gérer un projet de A à Z, et à respecter des délais et des contraintes techniques. Ce projet m'a permis de me familiariser avec les bonnes pratiques de développement, d'améliorer mes compétences en programmation et en conception de sites web, et de développer ma capacité à résoudre des problèmes complexes. Je suis fier du résultat obtenu et je suis convaincu que Gestscol est une solution efficace pour les établissements scolaires qui cherchent à améliorer leur gestion administrative et pédagogique.</p>"
    }
]