
[
    {
        "id": 1,
        "date": "17 Juin 2024",
        "title": "Gestscol",
        "author": "Eric WAGNER",
        "tags": [
            "Front-End",
            "Back-end",
            "Laravel",
            "TailwindCSS",
            "MySQL",
            "PHP"
        ],
        "description": "Gestscol est un site web réalisé dans le cadre d'un projet scolaire, afin de mettre en avant nos compétences en développement web.",
        "content":"<h4>Gestscol, c'est quoi ?</h4><h5>Fonctionnalités de Gestscol</h5><ul><li><span><strong>Gestion des inscriptions et des admissions :</strong></span><ul><li>Permet de gérer les inscriptions des nouveaux élèves et les réinscriptions des élèves actuels.</li><li>Automatise le processus d’admission, de la soumission de la candidature à l’acceptation finale.</li></ul></li><li><span><strong>Gestion des élèves :</strong></span><ul><li>Suivi des informations personnelles et académiques des élèves.</li><li>Gestion des dossiers scolaires, y compris les notes, les absences, les retards, et les sanctions disciplinaires.</li><li>Outils pour la communication avec les parents, incluant les bulletins de notes et les notifications.</li></ul></li><li><span><strong>Gestion des enseignants et du personnel :</strong></span><ul><li>Suivi des informations personnelles et professionnelles du personnel enseignant et administratif.</li><li>Gestion des emplois du temps, des congés et des absences.</li><li>Outils de planification et de répartition des tâches.</li></ul></li><li><span><strong>Gestion des emplois du temps :</strong></span><ul><li>Création et gestion des emplois du temps pour les élèves et les enseignants.</li><li>Prise en compte des contraintes spécifiques, comme les disponibilités des enseignants et la répartition des salles de classe.</li></ul></li><li><span><strong>Gestion financière :</strong></span><ul><li>Suivi des paiements des frais de scolarité et des autres frais.</li><li>Gestion des bourses, des subventions et des autres aides financières.</li><li>Génération de rapports financiers pour la comptabilité.</li></ul></li><li><span><strong>Gestion documentaire :</strong></span><ul><li>Centralisation des documents administratifs et pédagogiques.</li><li>Accès sécurisé aux documents pour les enseignants, les élèves et les parents.</li><li>Archivage des documents pour une consultation ultérieure.</li></ul></li><li><span><strong>Communication et collaboration :</strong></span><ul><li>Plateformes de communication entre les enseignants, les élèves et les parents.</li><li>Outils de collaboration pour les projets et les activités parascolaires.</li><li>Notifications et alertes pour les événements scolaires et les rappels importants.</li></ul></li></ul><h5>Objectifs de Gestscol</h5><ul><li><span><strong>Automatisation des processus administratifs :</strong></span> Réduire le temps consacré aux tâches administratives répétitives, permettant ainsi au personnel scolaire de se concentrer davantage sur l'enseignement et le soutien aux élèves.</li><li><span><strong>Centralisation des informations :</strong></span> Fournir une plateforme unique où toutes les informations relatives à l’école, aux élèves, aux enseignants et au personnel peuvent être stockées et gérées de manière efficace.</li><li><span><strong>Amélioration de la communication :</strong></span> Faciliter la communication entre les différents acteurs de la communauté scolaire, incluant les enseignants, les élèves, les parents et l’administration.</li><li><span><strong>Suivi académique :</strong></span> Permettre un suivi rigoureux et en temps réel des performances académiques des élèves, aidant ainsi à identifier les besoins spécifiques et à mettre en place des mesures de soutien appropriées.</li><li><span><strong>Sécurité et confidentialité :</strong></span> Assurer la protection des données personnelles et confidentielles de tous les utilisateurs du système grâce à des protocoles de sécurité avancés.</li><li><span><strong>Efficacité opérationnelle :</strong></span> Optimiser les ressources de l’école, qu’il s’agisse de la gestion des salles de classe, des emplois du temps, ou des finances, pour améliorer l’efficacité globale de l’établissement.</li></ul><p>En résumé, Gestscol est une solution intégrée qui vise à améliorer la gestion des établissements scolaires en centralisant et en automatisant de nombreuses tâches administratives et pédagogiques, tout en favorisant la communication et la collaboration entre les différents acteurs de la communauté éducative.</p><h4>Réalisations</h4><p>Pour réaliser ce site j'ai utilisé le framework PHP Laravel. Je devais mettre en place un emploi du temps qui correspondait à celui de la personne connectée. Je devais faire en sorte de créer les utilisateurs en fonction d'un fichier excel qui serait importé sur le site. J'ai pû réaliser ces fonctionnalités grâce à la librairie Maatwebsite/Laravel-Excel. J'ai également utilisé TailwindCSS pour le design du site. J'ai utilisé MySQL pour la base de données. J'ai également utilisé PHP pour la partie back-end du site.</p><h4>Conclusion</h4><p>Grâce à ce projet, j'ai pu mettre en pratique mes compétences en développement web, en utilisant des technologies modernes et en répondant à des besoins concrets. J'ai appris à travailler en équipe, à gérer un projet de A à Z, et à respecter des délais et des contraintes techniques. Ce projet m'a permis de me familiariser avec les bonnes pratiques de développement, d'améliorer mes compétences en programmation et en conception de sites web, et de développer ma capacité à résoudre des problèmes complexes. Je suis fier du résultat obtenu et je suis convaincu que Gestscol est une solution efficace pour les établissements scolaires qui cherchent à améliorer leur gestion administrative et pédagogique.</p>",
        "code": "https://github.com/WebWAGNER67/Gestscol",
        "link": "https://gestscol.ericwagner.fr/"
    },
    {
        "id": 2,
        "date": "17 Juin 2024",
        "title": "Festival du Houblon",
        "author": "Eric WAGNER",
        "tags": [
            "Front-End",
            "Back-end",
            "Code-Igniter",
            "MySQL",
            "PHP"
        ],
        "description": "Festival du Houblon est un site web réalisé dans le cadre d'un Stage à la mairie de Haguenau, afin de mettre en avant mes compétences en développement web.",
        "content":"<h4>Festival du Houblon, c'est quoi ?</h4><p>Le Festival du Houblon est un temps fort qui offre une programmation riche : partout dans la ville de Haguenau, des spectacles de musiques et danses traditionnelles se mèlent aux concerts de rock, d’afro-music, de salsa et bien plus encore. Une manière originale de rencontrer le monde entier en Alsace le temps d’une semaine rythmée !</p><h4>Réalisations</h4><p>Pour réaliser ce site j'ai utilisé le framework PHP CodeIgniter. Je devais faire une analyse du site existant et proposer une maquette de la nouvelle version qui a très vite étée acceptée. Ce travail m'a pris beaucoup de temps car quand je leur proposais une chose, ils revenaient 2 jours après pour des modifications qui m'ont fait perdre énormément de temps.</p><h4>Conclusion</h4><p>Grâce à ce projet, j'ai pu mettre en pratique mes compétences en développement web, en utilisant des technologies modernes et en répondant à des besoins concrets. J'ai appris à travailler avec de nouveaux outils, à gérer un projet de A à Z, et à respecter des délais et des contraintes techniques. Ce projet m'a permis de me familiariser avec les bonnes pratiques de développement, d'améliorer mes compétences en programmation et en conception de sites web, et de développer ma capacité à résoudre des problèmes complexes. Je suis fier du résultat obtenu et je suis convaincu que le site du Festival du Houblon a pû être amélioré grâce à mes compétences en développement web.</p>",
        "code": "",
        "link": "https://test.ericwagner.fr/"
    },
    {
        "id":7,
        "date": "26 Juin 2024",
        "title": "Eco",
        "author": "Eric WAGNER",
        "tags": [],
        "description": "Description de mes connaissances en Economie et en Gestion.",
        "content": "<h4>Pilotage de Produits, Services et Équipes</h4><p>Avec plusieurs années d'expérience dans la <strong>gestion de projets complexes</strong>, je me spécialise dans le <strong>pilotage de produits, services et équipes</strong> avec une <strong>efficacité</strong> et une <strong>rigueur</strong> inégalées. Mon approche est fondée sur une <strong>planification stratégique</strong> minutieuse et une <strong>exécution précise</strong>. En tant que <strong>leader</strong>, j'accorde une importance primordiale à la <strong>définition claire des objectifs</strong>, à l'<strong>allocation optimale des ressources</strong> et à la mise en place de <strong>processus robustes</strong> pour assurer la réussite des projets.</p><p>Ma capacité à gérer des <strong>équipes diversifiées</strong> est un atout majeur. Je crée un environnement de travail <strong>collaboratif</strong> où chaque membre se sent <strong>valorisé</strong> et motivé à donner le meilleur de lui-même. Grâce à des <strong>compétences de communication exceptionnelles</strong>, je m'assure que tous les membres de l'équipe sont alignés avec la vision et les objectifs du projet. Je favorise un <strong>esprit d'équipe fort</strong> et une <strong>culture de la performance</strong>, en encourageant l'<strong>innovation</strong> et la <strong>prise d'initiatives</strong>.</p><p>Je suis également très à l'aise avec la <strong>gestion de projets</strong> à l'aide de <strong>méthodologies modernes</strong> comme <strong>Agile</strong> et <strong>Scrum</strong>, ce qui permet d'assurer une grande <strong>flexibilité</strong> et <strong>réactivité</strong> face aux changements et aux défis imprévus. Mon <strong>leadership</strong> est caractérisé par une capacité à <strong>prendre des décisions éclairées rapidement</strong>, à <strong>résoudre les conflits</strong> de manière constructive et à maintenir un haut niveau de <strong>moral</strong> et de <strong>productivité</strong> au sein de l'équipe.</p><h4>Maîtrise de la Qualité en Projets Web et Multimédia</h4><p>Dans le domaine des projets <strong>Web</strong> et <strong>Multimédia</strong>, la <strong>qualité</strong> est un élément clé de mon approche. Je suis particulièrement attentif aux <strong>détails</strong> et m'assure que chaque aspect du projet respecte des <strong>standards élevés</strong> de qualité. Mon <strong>expertise technique</strong> me permet de superviser toutes les phases du développement, depuis la <strong>conception initiale</strong> jusqu'à la <strong>livraison finale</strong>, en passant par les phases de <strong>test</strong> et de <strong>déploiement</strong>.</p><p>Je mets en œuvre des pratiques de <strong>gestion de la qualité</strong> rigoureuses, telles que le <strong>contrôle de version</strong>, les <strong>tests automatisés</strong> et les <strong>revues de code</strong>, pour garantir que le produit final est à la fois <strong>performant</strong>, <strong>sécurisé</strong> et <strong>convivial</strong>. Mon approche est également <strong>centrée sur l'utilisateur</strong>, ce qui implique une attention particulière à l'<strong>expérience utilisateur (UX)</strong> et à l'<strong>interface utilisateur (UI)</strong>. Je veille à ce que les solutions développées soient non seulement <strong>fonctionnelles</strong>, mais aussi <strong>esthétiquement plaisantes</strong> et <strong>intuitives</strong> à utiliser.</p><p>Mon <strong>engagement envers la qualité</strong> se traduit également par une capacité à <strong>anticiper</strong> et à <strong>résoudre les problèmes</strong> avant qu'ils ne deviennent critiques. Je suis <strong>proactif</strong> dans la gestion des <strong>risques</strong> et utilise des <strong>outils de suivi de projet</strong> pour assurer une <strong>transparence totale</strong> et une <strong>communication efficace</strong> avec toutes les parties prenantes. Grâce à une approche <strong>méthodique</strong> et <strong>rigoureuse</strong>, je suis capable de livrer des projets qui <strong>dépassent les attentes</strong> en termes de <strong>qualité</strong> et de <strong>performance</strong>.</p><h4>Conception de Projets d'Entreprises Innovantes</h4><p>La <strong>conception de projets d'entreprises innovantes</strong> est un domaine dans lequel j'excelle. Mon approche commence par une <strong>analyse approfondie</strong> du <strong>marché</strong> et de l'<strong>environnement concurrentiel</strong> pour identifier des <strong>opportunités uniques</strong> et prometteuses. Je suis capable de transformer des <strong>idées novatrices</strong> en <strong>projets concrets</strong> en définissant des <strong>stratégies claires</strong> et des <strong>plans d'action détaillés</strong>.</p><p>La définition du <strong>nom</strong>, de l'<strong>identité</strong>, de la <strong>forme juridique</strong> et du <strong>ton de la marque</strong> est une étape cruciale que je maîtrise. Je travaille en étroite collaboration avec les parties prenantes pour créer une <strong>identité de marque</strong> <strong>cohérente</strong> et <strong>percutante</strong>, capable de se démarquer sur le marché. Mon <strong>expertise en branding</strong> et en <strong>marketing</strong> me permet de concevoir des stratégies qui <strong>résonnent avec le public cible</strong> et qui créent une forte <strong>reconnaissance de marque</strong>.</p><p>Je suis également compétent dans le choix de la <strong>forme juridique</strong> la plus appropriée pour l'entreprise, en tenant compte des aspects <strong>fiscaux</strong>, <strong>juridiques</strong> et <strong>opérationnels</strong>. Mon approche est <strong>holistique</strong>, intégrant des éléments de <strong>branding</strong>, de <strong>marketing</strong>, de <strong>finance</strong> et de <strong>stratégie commerciale</strong> pour créer une base solide pour l'entreprise. Je m'assure que chaque aspect du projet est aligné avec la <strong>vision globale</strong> et les <strong>valeurs fondamentales</strong> de l'entreprise, garantissant ainsi une <strong>croissance durable</strong> et un <strong>succès à long terme</strong>.</p><h4>Défense de Projets de Manière Convaincante</h4><p>La capacité à <strong>défendre un projet</strong> de manière <strong>convaincante</strong> est essentielle pour obtenir le <strong>soutien nécessaire</strong> à sa réalisation. Je possède une <strong>expertise reconnue</strong> dans l'art de la <strong>présentation</strong> et de la <strong>persuasion</strong>, que ce soit face à des <strong>investisseurs</strong>, des <strong>partenaires</strong> ou des <strong>clients potentiels</strong>. Mon approche est basée sur la <strong>préparation minutieuse</strong>, l'utilisation d'<strong>arguments solides</strong> et de <strong>données concrètes</strong>, et la mise en avant des <strong>bénéfices</strong> et du <strong>potentiel du projet</strong>.</p><p>Je suis capable de présenter des <strong>propositions</strong> de manière <strong>claire</strong>, <strong>concise</strong> et <strong>impactante</strong>, en captant l'<strong>attention</strong> de mon audience et en suscitant leur <strong>intérêt</strong>. Mon style de <strong>communication</strong> est à la fois <strong>passionné</strong> et <strong>rationnel</strong>, inspirant <strong>confiance</strong> et <strong>enthousiasme</strong> chez mes interlocuteurs. Je m'assure de répondre efficacement aux <strong>questions</strong> et de dissiper les <strong>doutes</strong>, en fournissant des <strong>réponses précises</strong> et <strong>pertinentes</strong>.</p><p>Grâce à ma capacité à structurer mes <strong>présentations</strong> de manière <strong>logique</strong> et à utiliser des <strong>supports visuels attrayants</strong>, je suis en mesure de communiquer des <strong>concepts complexes</strong> de manière <strong>simple</strong> et <strong>compréhensible</strong>. Mon expérience dans la <strong>défense de projets</strong> m'a permis de développer une expertise dans la <strong>gestion des objections</strong> et la <strong>négociation</strong>, ce qui me permet de <strong>rallier les parties prenantes</strong> autour de la <strong>vision du projet</strong> et de <strong>sécuriser les ressources</strong> nécessaires à sa mise en œuvre.</p>",
        "code": "",
        "link": ""  
    }
]